#define _CRT_SECURE_NO_WARNINGS 1 
//1.在屏幕上输出以下图案：
//       *
//      ***
//     *****
//    *******
//   *********
//  ***********
// *************
//  ***********
//   *********
//    *******
//     *****
//      ***
//       *
//
//2.求出0～999之间的所有“水仙花数”并输出。
//“水仙花数”是指一个三位数，其各位数字的立方和确好等于该数本身，如；153＝1＋5＋3 ? ，则153是一个“水仙花数”。
//
///*
//在数论中，水仙花数（Narcissistic number）也称为自恋数、自幂数、阿姆斯壮数或阿姆斯特朗数（Armstrong number），是指一N位数，其各个数之N次方和等于该数。
//例如153、370、371及407就是三位数的水仙花数，其各个数之立方和等于该数：
//153 = 1^3 + 5^3 + 3^3。
//370 = 3^3 + 7^3 + 0^3。
//371 = 3^3 + 7^3 + 1^3。
//407 = 4^3 + 0^3 + 7^3。
//*/
//
//
//3.
//求Sn = a + aa + aaa + aaaa + aaaaa的前5项之和，其中a是一个数字，
//例如：2 + 22 + 222 + 2222 + 22222
//打印菱形
//#include <stdio.h>
//int main()
//{
//	int line = 0;
//	int i = 0;
//	int j = 0;
//	printf("请输入你要打印的行数\n");
//	scanf("%d",&line);
//	for (i = 1; i <= line; i++)
//	{
//		for (j = 1; j <= line - i; j++)
//		{
//			printf(" ");
//		}
//		for (j = 1; j <= 2 * i - 1; j++)
//		{
//			printf( "*");
//		}
//		printf("\n");
//	}
	//方法一 通过i++方法打印菱形下半部分
	/*for (i = 1; i <= line-1 ; i++)
	{
		for (j = 1; j <= i ; j++)
		{
			printf(" ");
		}
		for (j = 1; j <= 2*(line-i)-1 ; j++)
		{
			printf("*");
		}
		printf("\n");
	}*/
	//方法二
	/*for (i = line - 1; i > 0; i--)
	{
		for (j = 1; j <= line - i; j++)
		{
			printf(" ");
		}
		for (j = 1; j <= 2 * i - 1; j++)
		{
			printf("*");
		}
		
		printf("\n");
	}
	system("pause");
}*/
//打印 杨辉三角形
#include <stdio.h>
int main()
{
	int a[100][100] = { 0 };
	int n = 0;
	printf("请你输入要打印杨辉三角形的行数\n");
	scanf("%d",&n);
	int i = 0;
	int j = 0;
	for (i = 1; i <= n; i++)
	{
		a[i][i] = 1;
	}
	for (i = 1; i <= n; i++)
	{
		a[0][i] = 1;
		for (j = 1; j <= i; j++)
		{
			a[i][j] = a[i - 1][j] + a[i - 1][j - 1];
		}
	}
	for (i = 1; i <= n; i++)
	{
		for (j = 1; j <= i; j++)
		{
			printf("%2d ",a[i][j] );
		}
		printf("\n");
	}
	system("pause");
}
//2
//略
//3
//略
